app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("alias", "btcjam_access_token", "btcjam_uid", "created_at", "email", "oauth_data", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "btcjam_access_token" = '72fadfeddcf61455ad5c6d0475119c090fb488d4ce63e28cc03881ca1947aba6', "updated_at" = '2013-04-28 15:52:59.302227' WHERE "users"."id" = 3
---
  def btcjam
    oauth_data = request.env["omniauth.auth"]

    @user = User.find_or_create_for_btcjam_oauth(oauth_data)
    @user.update_btcjam_credentials(oauth_data)